<div style="font-size:48px; line-height:1.2;">
    <center>
COMS W4111-002, Fall 21: <br>Take Home Midterm
</center>


<hr style="height:2px;">
<br>

<div style="font-size:48px; line-height:1.2;">
    <center>
COMS W4111-002, Fall 21: <br>Take Home Midterm
</center>


<hr style="height:2px;">
<br>

# Overview

## Instructions

#### Due Date: Sunday, October 31, 2021 at 11:59pm  


You have one week to complete the take home portion of the midterm. All of the work must be your own, you may not work in groups or teams. You may use outside sources so long as you cite them and provide links. 

Points will be taken off for any answers that are extremely verbose. Try to stay between 2-3 sentences for definitions and 5 sentences for longer questions. 

You may post __privately__ on Ed or attend OH for clairification questions. TAs will not be providing hints.

## Environment Setup

- __Note:__ You will need to change the MySQL userID and password in some of the cells below to match your configuration.

In [11]:
%load_ext sql

In [13]:
%sql mysql+pymysql://root:dbuserdbuser@localhost

'Connected: root@None'

In [14]:
from sqlalchemy import create_engine

In [16]:
sql_engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

In [17]:
import pandas as pd

# Written Questions

## W1

Provide a short (two or three sentence) definition/description of the following terms. Provide an example from the Lahman's Baseball DB for each.

__Notes:__
- Lahman's Baseball DB uses auto-increment ID columns for primary keys. If ignoring the ID column makes answering the question easier, you can assume that the column and current primary keys are not defined.
- Some of these concepts do not have a single, precise, agreed definition. You may find slight differences in your research. Focus on the concept and grading will be flexible.
<br><br><br>

1. Super Key<br><br>
1. Candidate Key<br><br>
1. Primary Key<br><br>
5. Alternate Key<br><br>
6. Unique Key<br><br>
2. Natural Key<br><br>
2. Surrogate Key<br><br>
2. Substitute Key<br><br>
7. Foreign Key<br><br>
8. External Key

<u>Answer</u>

# W2

- Define the concept of _immutable_ column and key.


- Why do some sources recommend that a primary key should be immutable?


- How would to implement immutability for a primary key in a table?

<u>Answer</u>

# W3

_Views_ are a powerful concept in relational database management systems. List and briefly explain 3 benefits of/reasons for creating a view.

<u>Answer</u>

# W4

Briefly explain the concepts of _procedural_ language and _declarative_ language. SQL is a declarative language. What are some advantages of a declarative language over a procedural language?

<u>Answer</u>

# W5

The following diagram is a simple representation of the architecture of a Jupyter notebook using MySQL. Is this a two-tier architecture or a three-tier architecture? Explain your answer briefly.

<img src="./jupyter-architecture.png">

<u>Answer</u>

# W6

What is the difference between the database schema and the database instance? 
Use the following conventions of the relational model for documenting a relation schema to answer the question if:
1. $country\_code$ is the country code for the phone number, e.g. +1
2. $main\_number$ is the main number, e.g. 212-555-1212.
3. $extension$ is the extension, e.g. x1002
4. $phone\_type$ is an enum, e.g. _work, home, mobile, others._
<br><br>

\begin{equation}
PhoneNumber(\underline{country\_code)}, \underline{main\_number}, \underline{extension}, phone\_type)
\end{equation}

<br><br>

<u>Answer</u>

# W7

Briefly explain the differences between:

- Database stored procedure
- Database function
- Database trigger

<u>Answer</u>

# W8

Briefly explain:

- Natural join
- Equi-join
- Theta join
- Self-join

<u>Answer</u>

# W9

Briefly explain the difference between a _unique (key) constraint_ and a _primary key constraint?_

<u>Answer</u>

# W10

Briefly explan _domain constraint_ and give an example.

# Entity Relationship Model

<u>Question</u>

- This question tests transforming a high-level description of a data model into a more concrete logical ER diagram. You will produce a logical ER-diagram using Lucidchart, or a similar tool. You should use Crow's Foot notation and conventions we have used in lectures.


- The data model is a simple representation of a university.


- The model has the following entity types.
    - School:
        - School code, e.g. "SEAS," "GSAS," "LAW," ... ...
        - School name, e.g. "School of Engineering and Applied Science."
    - Department:
        - Department code, e.g. "COMS," "MATH," "ECON," ... ...
        - Department name, e.g. "Department of Computer Science."
    - Faculty:
        - UNI
        - last_name
        - first_name
        - email
        - title, e.g. "Professor," "Adjunct Professor," ... ...
    - Student:
        - UNI
        - last_name
        - first_name
        - email
    - Course:
        - Course number is a composite key, e.g. "COMSW4111" is
            - Dept. code "COMS"
            - Faculty code "W"
            - Course number "4111"
        - Course title
        - Course description
    - Section:
        - Call number
        - Course number
        - Year
        - Semester
        - Section
        
        
- A Faculty has complex states and relationships.
    - A Faculty can have a role relative to a Department, e.g. Chair.
    - Roles are a small set of possible values.
    - Roles change over time. The data model must support the ability to handle current roles and previous roles.
    - A Faculty can have a role in a department at most once.
    
    
- A Student has a relationship to Section.
    - The possible roles are ```(Enrolled, Waitlist, Dropped, TA)```
    - The student has a current role, and there can be only one current row.
    - The data model must support the ability to handle roles changing over time and retaining information about prior roles.
    
    
- A Faculty _may_ teach a Section. All sections have exactly one Faculty.


- The relationship between Department and School is many-to-many. Each Department is in at least one school and each school has at least one department.
    
    
__Notes:__
1. There is no single correct answer to this question. You will have to make some design decisions and assumptions. You should document your decisions and assumptions.
2. You do not have to worry about __isA__ relationships.
3. You do not have to document or worry about attribute types.
4. The ER diagram must be implementable in the relational/SQL model.

<u>Answer</u>

_Assumptions, Decsions and Notes:_

1. ... ...
2. ... ...

# Relational Algebra

## R1

Use the [RelaX Calculator and the Silberschatz - UniversityDB](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) for this question. 

Two time slots _X_ and _Y_ obviously overlap if:
1. They are not the same time slot, i.e. do not have the same $time\_slot\_id$.
2. They have at least one lecture on _the same day,_  the start hour for _X_ is before the start hour for _Y_, and the end hour for _X_ is after the start hour for _Y._
3. To make the question easier, you do not need to consider minutes in computing overlap but must show minutes in the result.

Write the relational algebra expression that identifies obviously overlapping time slots, and only lists overlapping pairs of time slots once. 

Your output must match the answer below. 

<img src='./relational_result.png'>

<u> Answer

## R2

1. You __may not__ use the subtraction operator ```-``` to write this query.
2. Produce a relation that:
    - Has column names ```instructor_ID, instructor_name.```
    - Contains the ```ID``` and ```name``` of instructors who do not advise any students.

<u> Answer

# SQL Schema and DDL

### Objective

- You have a logical datamodel ER-diagram (see below).


- You need to use DDL to define a schema that realizes the model.


- Logical models are not specific enough for direct implementation. This means that:
    - You will have to assign concrete types to columns, and choose things like ```GENERATED,``` ```DEFAULT,``` etc.
    - You may have to decompose a table into two tables, or extract common attributes from multiple tables into a single, referenced table.
    - Implementing the relationships may require adding columns and foreign keys, associative entities, etc.
    - You may have to make other design and implementation choices. <b>This means that there is no single correct answer.</b>

### ER Diagram

| <img src="./er-to-sql-3.png"> |
| :---: |
| __ER Diagram__ |

<u>Answer</u>

_Design Decisions, Notes, etc._

_DDL_

- Execute your DDL in the cell below. You may use DataGrip or other tools to help build the schema.


- You can copy and paste the ```SQL CREATE TABLE``` below, but you MUST execute the statements.

In [ ]:
# DDL in cells below.

## Complex SQL

### Birth Countries and Death Countries

<u>Question</u>

- In ```lahmansbaseballdb.people``` there is information about people's ```birthCountry``` and ```deathCountry.```



- There are countries in which at least person was born but in which no person has died. 


- Write a query that produces a table of the form:
    - ```birthCountry```
    - ```no_of_births```, which is the total number of births in the country
    
    
- The table contains all rows in which there with births but no deaths.

<u>Answer</u>

 * mysql+pymysql://dbuser:***@localhost
35 rows affected.

[('Germany', 45),
 ('Colombia', 24),
 ('South Korea', 23),
 ('Curacao', 15),
 ('Nicaragua', 15),
 ('Russia', 9),
 ('Italy', 7),
 ('Czech Republic', 6),
 ('Aruba', 5),
 ('Brazil', 5),
 ('Poland', 5),
 ('Sweden', 4),
 ('Spain', 4),
 ('Jamaica', 4),
 ('Norway', 3),
 ('Honduras', 2),
 ('Guam', 2),
 ('South Africa', 2),
 ('Saudi Arabia', 2),
 ('Afghanistan', 1),
 ('Greece', 1),
 ('Hong Kong', 1),
 ('Viet Nam', 1),
 ('Denmark', 1),
 ('Switzerland', 1),
 ('Singapore', 1),
 ('Belgium', 1),
 ('Peru', 1),
 ('Belize', 1),
 ('Indonesia', 1),
 ('Finland', 1),
 ('Lithuania', 1),
 ('Slovakia', 1),
 ('Portugal', 1),
 ('Latvia', 1)]

### Best Baseball Players

<u>Question</u>

- This question uses ```lahmansbaseballdb.batting```, ```lahmansbaseballdb.pitching``` and ```lahmansbaseballdb.people```.


- There query computes performance metrics:
    - Batting:
        - On-base percentage: OBP is (sum(h) + sum(BB))/(sum(ab) + sum(BB))
        - Slugging percentage: SLG is        
```
    (
        (sum(h) - sum(`1b`) - sum(`2b`) - sum(`3b`) - sum(hr)) +
        2*sum(`2b`) + 3*sum(`3b`) + 4*hr
    )/sum(ab)
```
        - On-base percentage plus slugging: OPS is is ```(obp + slg)```.
    - Pitching:
        - total_wins is ```sum(w)```.
        - total_loses is ```sum(l)```.
        - win_percentage is ```sum(w)/(sum(w) + sum(l))```.
        
        
- Professor Ferguson has two criteria for someone being a great baseball player.
    - Batting:
        - Total number of ```ab >= 1000```.
        - OPS: Career ```OPS >= .000```
    - Pitching:
        - ```(sum(w) + sum(l)) >= 200```.
        - ```win_percentage >= 0.70)``` or ```sum(w) >= 300.```
        
        
- This is one of the rare cases where Prof. Ferguson will provide the answer. So, please produce the table below. Some notes:
    - ```great_because``` is either ```Pitcher``` or ```Batter``` based on whether the player matched the batting or pitching criteria.
    - The values from ```batting``` are ```None``` if the player did not qualify based on batting.
    - The values from ```pitching``` are ```None``` if the player did not qualify on pitching.

<u>Answer</u>

 * mysql+pymysql://dbuser:***@localhost
0 rows affected.

[]

 * mysql+pymysql://dbuser:***@localhost
32 rows affected.

[('spaldal01', 'Spalding', 'Al', 'Pitcher', datetime.date(1871, 5, 5), datetime.date(1878, 8, 31), 'spaldal01', None, None, None, Decimal('252'), Decimal('65'), Decimal('0.7950')),
 ('galvipu01', 'Galvin', 'Pud', 'Pitcher', datetime.date(1875, 5, 22), datetime.date(1892, 8, 2), 'galvipu01', None, None, None, Decimal('365'), Decimal('310'), Decimal('0.5407')),
 ('welchmi01', 'Welch', 'Mickey', 'Pitcher', datetime.date(1880, 5, 1), datetime.date(1892, 5, 17), 'welchmi01', None, None, None, Decimal('307'), Decimal('210'), Decimal('0.5938')),
 ('radboch01', 'Radbourn', 'Old Hoss', 'Pitcher', datetime.date(1880, 5, 5), datetime.date(1891, 8, 11), 'radboch01', None, None, None, Decimal('310'), Decimal('194'), Decimal('0.6151')),
 ('keefeti01', 'Keefe', 'Tim', 'Pitcher', datetime.date(1880, 8, 6), datetime.date(1893, 8, 15), 'keefeti01', None, None, None, Decimal('342'), Decimal('225'), Decimal('0.6032')),
 ('clarkjo01', 'Clarkson', 'John', 'Pitcher', datetime.date(1882, 5, 2), datetime.date(1894, 7, 12), 'clarkjo01', None, None, None, Decimal('328'), Decimal('178'), Decimal('0.6482')),
 ('nichoki01', 'Nichols', 'Kid', 'Pitcher', datetime.date(1890, 4, 23), datetime.date(1906, 5, 18), 'nichoki01', None, None, None, Decimal('362'), Decimal('208'), Decimal('0.6351')),
 ('youngcy01', 'Young', 'Cy', 'Pitcher', datetime.date(1890, 8, 6), datetime.date(1911, 10, 6), 'youngcy01', None, None, None, Decimal('511'), Decimal('315'), Decimal('0.6186')),
 ('mathech01', 'Mathewson', 'Christy', 'Pitcher', datetime.date(1900, 7, 17), datetime.date(1916, 9, 4), 'mathech01', None, None, None, Decimal('373'), Decimal('188'), Decimal('0.6649')),
 ('planked01', 'Plank', 'Eddie', 'Pitcher', datetime.date(1901, 5, 13), datetime.date(1917, 8, 6), 'planked01', None, None, None, Decimal('326'), Decimal('194'), Decimal('0.6269')),
 ('johnswa01', 'Johnson', 'Walter', 'Pitcher', datetime.date(1907, 8, 2), datetime.date(1927, 9, 30), 'johnswa01', None, None, None, Decimal('417'), Decimal('279'), Decimal('0.5991')),
 ('alexape01', 'Alexander', 'Pete', 'Pitcher', datetime.date(1911, 4, 15), datetime.date(1930, 5, 28), 'alexape01', None, None, None, Decimal('373'), Decimal('208'), Decimal('0.6420')),
 ('ruthba01', 'Ruth', 'Babe', 'Batter', datetime.date(1914, 7, 11), datetime.date(1935, 5, 30), 'ruthba01', Decimal('0.4718'), Decimal('0.6898'), Decimal('1.1616'), None, None, None),
 ('hornsro01', 'Hornsby', 'Rogers', 'Batter', datetime.date(1915, 9, 10), datetime.date(1937, 7, 20), 'hornsro01', Decimal('0.4308'), Decimal('0.5765'), Decimal('1.0073'), None, None, None),
 ('gehrilo01', 'Gehrig', 'Lou', 'Batter', datetime.date(1923, 6, 15), datetime.date(1939, 4, 30), 'gehrilo01', Decimal('0.4447'), Decimal('0.6324'), Decimal('1.0772'), None, None, None),
 ('grovele01', 'Grove', 'Lefty', 'Pitcher', datetime.date(1925, 4, 14), datetime.date(1941, 9, 28), 'grovele01', None, None, None, Decimal('300'), Decimal('141'), Decimal('0.6803')),
 ('foxxji01', 'Foxx', 'Jimmie', 'Batter', datetime.date(1925, 5, 1), datetime.date(1945, 9, 23), 'foxxji01', Decimal('0.4275'), Decimal('0.6093'), Decimal('1.0368'), None, None, None),
 ('greenha01', 'Greenberg', 'Hank', 'Batter', datetime.date(1930, 9, 14), datetime.date(1947, 9, 18), 'greenha01', Decimal('0.4103'), Decimal('0.6050'), Decimal('1.0153'), None, None, None),
 ('willite01', 'Williams', 'Ted', 'Batter', datetime.date(1939, 4, 20), datetime.date(1960, 9, 28), 'willite01', Decimal('0.4806'), Decimal('0.6338'), Decimal('1.1144'), None, None, None),
 ('wynnea01', 'Wynn', 'Early', 'Pitcher', datetime.date(1939, 9, 13), datetime.date(1963, 9, 13), 'wynnea01', None, None, None, Decimal('300'), Decimal('244'), Decimal('0.5515')),
 ('spahnwa01', 'Spahn', 'Warren', 'Pitcher', datetime.date(1942, 4, 19), datetime.date(1965, 10, 1), 'spahnwa01', None, None, None, Decimal('363'), Decimal('245'), Decimal('0.5970')),
 ('perryga01', 'Perry', 'Gaylord', 'Pitcher', datetime.date(1962, 4, 14), datetime.date(1983, 9, 21), 'perryga01', None, None, None, Decimal('314'), Decimal('265'), Decimal('0.5423')),
 ('niekrph01', 'Niekro', 'Phil', 'Pitcher', datetime.date(1964, 4, 15), datetime.date(1987, 9, 27), 'niekrph01', None, None, None, Decimal('318'), Decimal('274'), Decimal('0.5372')),
 ('carltst01', 'Carlton', 'Steve', 'Pitcher', datetime.date(1965, 4, 12), datetime.date(1988, 4, 23), 'carltst01', None, None, None, Decimal('329'), Decimal('244'), Decimal('0.5742')),
 ('suttodo01', 'Sutton', 'Don', 'Pitcher', datetime.date(1966, 4, 14), datetime.date(1988, 8, 9), 'suttodo01', None, None, None, Decimal('324'), Decimal('256'), Decimal('0.5586')),
 ('ryanno01', 'Ryan', 'Nolan', 'Pitcher', datetime.date(1966, 9, 11), datetime.date(1993, 9, 22), 'ryanno01', None, None, None, Decimal('324'), Decimal('292'), Decimal('0.5260')),
 ('seaveto01', 'Seaver', 'Tom', 'Pitcher', datetime.date(1967, 4, 13), datetime.date(1986, 9, 19), 'seaveto01', None, None, None, Decimal('311'), Decimal('205'), Decimal('0.6027')),
 ('clemero02', 'Clemens', 'Roger', 'Pitcher', datetime.date(1984, 5, 15), datetime.date(2007, 9, 16), 'clemero02', None, None, None, Decimal('354'), Decimal('184'), Decimal('0.6580')),
 ('bondsba01', 'Bonds', 'Barry', 'Batter', datetime.date(1986, 5, 30), datetime.date(2007, 9, 26), 'bondsba01', Decimal('0.4428'), Decimal('0.6069'), Decimal('1.0497'), None, None, None),
 ('maddugr01', 'Maddux', 'Greg', 'Pitcher', datetime.date(1986, 9, 3), datetime.date(2008, 9, 27), 'maddugr01', None, None, None, Decimal('355'), Decimal('227'), Decimal('0.6100')),
 ('glavito02', 'Glavine', 'Tom', 'Pitcher', datetime.date(1987, 8, 17), datetime.date(2008, 8, 14), 'glavito02', None, None, None, Decimal('305'), Decimal('203'), Decimal('0.6004')),
 ('johnsra05', 'Johnson', 'Randy', 'Pitcher', datetime.date(1988, 9, 15), datetime.date(2009, 10, 4), 'johnsra05', None, None, None, Decimal('303'), Decimal('166'), Decimal('0.6461'))]

### Putting Together DDL, DML, Functions, Triggers

<u>Question</u>

- Use the database that comes with the textbook for this question.
    - Create a new database ```db_book_midterm.```
    - Copy the data and table definitions for ```Student``` and ```Instructor```
    - You may have to remove some constraints from the copied data/definition to make it work.


- Base tables:
    - ```Student``` has the form ```Student(ID, name, dept_name, total_cred)```.
    - ```Instructor``` has the form ```Instructor(ID, name, dept_name, salary)```.
    
    
- There is a _logical_ base type ```Person.``` The logical ```isA``` model is:


| <img src='./oo-model.png'> |
| :---: |
| __Logical Model__ |



- ```role``` is either ```S``` or ```F``` based on whether the ```Person``` is a ```Student``` or ```Instructor```.


- Implement a _two table_ solution to realize ```Person.``` This means define ```Person``` as a view.


- You do not need to worry about generating the primary key ID. Your implementation MUST, however, enforce the rule that the ID is immutable.



- You must also create a _stored procedure_ ```create_person```. The template for the implementation is:

```
CREATE DEFINER=`root`@`localhost` PROCEDURE `create_person`(
	in person_name varchar(32),
    in dept_name varchar(32),
    in total_cred decimal(3,0),
    in salary decimal(8,2),
    out ID varchar(5)
    )
BEGIN

	declare bad_person boolean;
    declare new_id varchar(12);
    
    set bad_person = false;
    set new_id = '00000';
    
    
    /*
		The logic of the stored procedure is the following:
			- The request is invalid and sets bad_person to true if:
				- Any of person_name, dept_name is NULL.
                - Either total_cred is NULL and salary is NOT NULL, or salary is NULL and total_cred is NULL. 
			- The procedure must compute a new, unique ID. The approach is to find the manimum
                ID value over Student and Instructor. Add 1 to the value to produce the new, unique ID.
            - The procedure then adds the information to Student or Instructor based on whether
                total_cred is NULL or salary is NULL.
    */
    
    /* <YOUR CODE GOES HERE> */
    
    if bad_person is true then
		SIGNAL SQLSTATE '50001'
			SET MESSAGE_TEXT = 'Invalid Person information input';
	end if;
    
    /* NOTE: ID is the out parameter. You must set ID to the new, unique ID */

END
```

<u>Answer</u>

_Create view statement_

~~~~sql
CREATE DATABASE db_book_midterm;

CREATE TABLE IF NOT EXISTS db_book_midterm.Student LIKE f21midterm.student;
INSERT db_book_midterm.Student SELECT * FROM f21midterm.student;

CREATE TABLE IF NOT EXISTS db_book_midterm.Instructor LIKE f21midterm.Instructor;
INSERT db_book_midterm.Instructor SELECT * FROM f21midterm.Instructor;


create view Person as select * from
(select id, name, dept_name, 'F' role from db_book_midterm.Instructor as ins
union
select id, name, dept_name, 'S' role from db_book_midterm.Student as std) as new;
~~~~~

_Create procedure statement_

_Tests_

Run the SQL in the following cells to test your solution.

- Test 1: Show the view.

In [56]:
%sql select * from Person;

 * mysql+pymysql://dbuser:***@localhost
25 rows affected.

[('10101', 'Srinivasan', 'Comp. Sci.', 'I'),
 ('12121', 'Wu', 'Finance', 'I'),
 ('15151', 'Mozart', 'Music', 'I'),
 ('22222', 'Einstein', 'Physics', 'I'),
 ('32343', 'El Said', 'History', 'I'),
 ('33456', 'Gold', 'Physics', 'I'),
 ('45565', 'Katz', 'Comp. Sci.', 'I'),
 ('58583', 'Califieri', 'History', 'I'),
 ('76543', 'Singh', 'Finance', 'I'),
 ('76766', 'Crick', 'Biology', 'I'),
 ('83821', 'Brandt', 'Comp. Sci.', 'I'),
 ('98345', 'Kim', 'Elec. Eng.', 'I'),
 ('00128', 'Zhang', 'Comp. Sci.', 'S'),
 ('12345', 'Shankar', 'Comp. Sci.', 'S'),
 ('19991', 'Brandt', 'History', 'S'),
 ('23121', 'Chavez', 'Finance', 'S'),
 ('44553', 'Peltier', 'Physics', 'S'),
 ('45678', 'Levy', 'Physics', 'S'),
 ('54321', 'Williams', 'Comp. Sci.', 'S'),
 ('55739', 'Sanchez', 'Music', 'S'),
 ('70557', 'Snow', 'Physics', 'S'),
 ('76543', 'Brown', 'Comp. Sci.', 'S'),
 ('76653', 'Aoi', 'Elec. Eng.', 'S'),
 ('98765', 'Bourikas', 'Elec. Eng.', 'S'),
 ('98988', 'Tanaka', 'Biology', 'S')]

_Create an Instructor and Student_

In [57]:
%sql CALL create_person('Ferguson', 'Comp. Sci.',  NULL, 30000.00, @prof_id);

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[]

In [59]:
%sql SELECT @prof_id;

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(98989,)]

In [63]:
%sql CALL create_person('Ferguson', 'Comp. Sci.',  100.0, NULL, @student_id);

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[]

In [64]:
%sql SELECT @student_id;

 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

[(98990,)]

- Try an error

In [65]:
try:
    %sql CALL create_person('Ferguson', 'Comp. Sci.',  100.0, 30000, @student_id);
except Exception as e:
    print(e)
res = %sql select @student_id;

 * mysql+pymysql://dbuser:***@localhost
(pymysql.err.OperationalError) (1644, 'Invalid Person information input')
[SQL: CALL create_person('Ferguson', 'Comp. Sci.',  100.0, 30000, @student_id);]
(Background on this error at: http://sqlalche.me/e/e3q8)
 * mysql+pymysql://dbuser:***@localhost
1 rows affected.

_Include DDL that Show Enforcing Immutable ID_

_Write a test that shows you implemented immutable IDs_

# Data and Schema Cleanup

## Part 1 $-$ Countries and Cities

- There is a file  ```worldcities``` in the same folder as this notebook.


- In the following code cell, use Pandas to:
    - Read the CSV file into a Data Frame.
    - Convert the Data Frame to contain only the following columns:
        - ```city```
        - ```city_ascii```
        - ```lat```
        - ```lng```
        - ```country```
        - ```iso2```
        - ```iso2```
        - ```id```
    - Write the data to the table ```worldcities``` in the schema ```F21W4111Midterm.```
    
    
- Use the SQL after the code cell to display part of your new table.


<u>Answer</u>

In [63]:
import pandas as pd
wc_df = pd.read_csv('./worldcities.csv')

In [64]:
wc_df = wc_df[["city", "city_ascii", "lat", "lng", "country", "iso2", "iso3", "id"]]

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="dbuserdbuser"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE F21W4111Midterm")
wc_df.to_sql('worldcities', con = create_engine("mysql+pymysql://root:dbuserdbuser@localhost/F21W4111Midterm"), \
            if_exists='replace')

NameError: name 'wc_df' is not defined


- Display data.

In [66]:
%sql select * from F21Midterm.worldcities order by city limit 30;

   mysql+pymysql://root:***@localhost
 * mysql+pymysql://root:***@localhost:3306/F21W4111Midterm
30 rows affected.

[(19249, 'Adr', '`Adra', 33.6, 36.515, 'Syria', 'SY', 'SYR', 1760640037),
 (9815, 'Ajln', '`Ajlun', 32.3325, 35.7517, 'Jordan', 'JO', 'JOR', 1400775371),
 (2469, 'Ajmn', '`Ajman', 25.3994, 55.4797, 'United Arab Emirates', 'AE', 'ARE', 1784337875),
 (13032, 'Akko', '`Akko', 32.9261, 35.0839, 'Israel', 'IL', 'ISR', 1376781950),
 (23726, 'Alavcheh', '`Alavicheh', 33.0528, 51.0825, 'Iran', 'IR', 'IRN', 1364605877),
 (9612, 'Amrn', '`Amran', 15.6594, 43.9439, 'Yemen', 'YE', 'YEM', 1887433410),
 (13142, 'md', '`Amuda', 37.1042, 40.93, 'Syria', 'SY', 'SYR', 1760247135),
 (26026, 'Anadn', '`Anadan', 36.2936, 37.0444, 'Syria', 'SY', 'SYR', 1760993442),
 (37808, 'Assl al Ward', '`Assal al Ward', 33.8658, 36.4133, 'Syria', 'SY', 'SYR', 1760181042),
 (6512, 'Ataq', '`Ataq', 14.55, 46.8, 'Yemen', 'YE', 'YEM', 1887172893),
 (35329, 'Ayn s', '`Ayn `Isa', 36.3858, 38.8472, 'Syria', 'SY', 'SYR', 1760078370),
 (4900, 'Ibr', '`Ibri', 23.2254, 56.517, 'Oman', 'OM', 'OMN', 1512077267),
 (22092, 'An Abessa', "'Ain Abessa", 36.3, 5.295, 'Algeria', 'DZ', 'DZA', 1012074116),
 (13597, 'An Arnat', "'Ain Arnat", 36.1833, 5.3167, 'Algeria', 'DZ', 'DZA', 1012453452),
 (13002, 'An Azel', "'Ain Azel", 35.8433, 5.5219, 'Algeria', 'DZ', 'DZA', 1012746080),
 (19677, 'An el Hammam', "'Ain el Hammam", 36.5647, 4.3061, 'Algeria', 'DZ', 'DZA', 1012595495),
 (28994, 'An Leuh', "'Ain Leuh", 33.2833, -5.3833, 'Morocco', 'MA', 'MAR', 1504668626),
 (26882, 'An Roua', "'Ain Roua", 36.3344, 5.1806, 'Algeria', 'DZ', 'DZA', 1012529757),
 (20104, 'Ali Ben Sliman', "'Ali Ben Sliman", 31.9053, -7.2144, 'Morocco', 'MA', 'MAR', 1504127885),
 (22485, 'Ayn Bni Mathar', "'Ayn Bni Mathar", 34.0889, -2.0247, 'Morocco', 'MA', 'MAR', 1504845272),
 (3842, 's-Hertogenbosch', "'s-Hertogenbosch", 51.6833, 5.3167, 'Netherlands', 'NL', 'NLD', 1528012333),
 (1746, 'A Corua', 'A Coruna', 43.3713, -8.4188, 'Spain', 'ES', 'ESP', 1724417375),
 (2400, 'Aachen', 'Aachen', 50.7762, 6.0838, 'Germany', 'DE', 'DEU', 1276805572),
 (29829, 'Aadorf', 'Aadorf', 47.4939, 8.8975, 'Switzerland', 'CH', 'CHE', 1756022542),
 (4077, 'Aalborg', 'Aalborg', 57.0337, 9.9166, 'Denmark', 'DK', 'DNK', 1208789278),
 (11447, 'Aalen', 'Aalen', 48.8372, 10.0936, 'Germany', 'DE', 'DEU', 1276757787),
 (15609, 'Aalsmeer', 'Aalsmeer', 52.2639, 4.7625, 'Netherlands', 'NL', 'NLD', 1528899853),
 (10664, 'Aalst', 'Aalst', 50.9333, 4.0333, 'Belgium', 'BE', 'BEL', 1056695813),
 (17071, 'Aalten', 'Aalten', 51.925, 6.5808, 'Netherlands', 'NL', 'NLD', 1528326020),
 (20206, 'nekoski', 'Aanekoski', 62.6042, 25.7264, 'Finland', 'FI', 'FIN', 1246710490)]

## P2 $-$ Modify World City Data

- Having multiple rows that repeat ```country, iso2``` and ```iso3``` is a poor design.


- Create two new tables:
    - ```countries``` that contains ```country, iso2``` and ```iso3.```
    - ```cities``` that contains only the remaining fields.
    - Pick either ```iso2``` or ```iso3``` to define a foreign key between the tables.
    
    
- Add primary keys, unique keys, select column data types, etc. to define a better schema for the two tables.
    
    
- Show you SQL statements for creating and modifying the tables below.


- __Note:__ A small number of the ISO2 and ISO3 codes are incorrect and will prevent creating keys. You must correct this data.


- Show you DDL below.

<u>Answer</u>

<b><u>Note</u>:</b> iso2 has a null value in one of the rows. The row has iso3 value as "NAM". No other column has an iso2 value of "NA". Hence, it is a reasonable assumption that the iso2 value for this particular value was lost and can be safely replaced as "NA" corresponding to its iso3 value of "NAM". The rest is self-explainatory.

~~~~sql
drop table F21Midterm.cities
drop table F21Midterm.countries

CREATE TABLE F21Midterm.cities AS (SELECT city, city_ascii, lat, lng, id , iso2 FROM F21Midterm.worldcities);
alter table F21Midterm.cities modify city varchar(100) not null;
alter table F21Midterm.cities modify city_ascii varchar(100) not null;
alter table F21Midterm.cities modify lat double;
alter table F21Midterm.cities modify lng double;
alter table F21Midterm.cities modify id bigint unique;
update F21Midterm.cities set iso2 = 'NA' where iso2 is NULL;
alter table F21Midterm.cities modify iso2 char(2) not null;


CREATE TABLE F21Midterm.countries AS (SELECT distinct country, iso2, iso3 FROM F21Midterm.worldcities);
alter table F21Midterm.countries modify country varchar(100) not null;
alter table F21Midterm.countries modify iso2 char(2) unique;
alter table F21Midterm.countries modify iso3 char(3);
update F21Midterm.countries set iso2 = 'NA' where iso2 is NULL;

alter table F21Midterm.countries
	add constraint countries_pk
		primary key (iso2);

alter table F21Midterm.cities
	add constraint cities_pk
		primary key (id);

alter table F21Midterm.cities
	add constraint cities_countries_iso2_fk
		foreign key (iso2) references countries (iso2);
~~~~

## P3 $-$ An Easy Question

- An interesting question. Is there a better SQL type for latitude and longitude than ```DOUBLE```? If you think there is a better type, what would it be? (You do not need to perform any conversions)

<u>Answer</u>

DECIMAL(3,4) is a better data type for longitude. This is because it can only have values between -180 and 180 respectively. Simliarly, DECIMAL(2, 4) is a better datatype for latitude as it can only take values between -90 and 90. The "4" in both is to represent decimal precision.

## FInal Create Table Statements

- Use the DataGrip tool to generate final ```CREATE TABLE``` statements below. You do not need to execute the statements.



<u>Answer</u>

~~~~sql
create table if not exists worldcities
(
    `index`    bigint null,
    city       text   null,
    city_ascii text   null,
    lat        double null,
    lng        double null,
    country    text   null,
    iso2       text   null,
    iso3       text   null,
    id         bigint null
);

create index ix_worldcities_index
    on worldcities (`index`);

create table if not exists countries
(
    country varchar(100) not null,
    iso2    char(2)      not null,
    iso3    char(3)      null,
    constraint countries_country_uindex
        unique (country),
    constraint iso2
        unique (iso2)
);

alter table countries
    add primary key (iso2);


create table if not exists cities
(
    city       varchar(100) not null,
    city_ascii varchar(100) not null,
    lat        double       null,
    lng        double       null,
    id         bigint       not null,
    iso2       char(2)      not null,
    constraint id
        unique (id),
    constraint cities_countries_iso2_fk
        foreign key (iso2) references countries (iso2)
);

alter table cities
    add primary key (id);


~~~~

## Fixing People Table

<u>Create a Copy People</u>

- Create a table ```F21Midterm.people_modified``` that has the same schema and data as ```lahmansbaseballdb.people```.


- SQL:

<u>Answer</u>

~~~~sql
CREATE TABLE IF NOT EXISTS f21midterm.people_modified LIKE lahmansbaseballdb.people;
INSERT f21midterm.people_modified SELECT * FROM lahmansbaseballdb.people;
~~~~

<u>Fixing ```birthCountry```</u>

- The query below indicates that some ```birthCountry``` entries in ```people``` do not map to a know country.

In [41]:
%%sql


select distinct birthCountry, count(*) as count  from people_modified where
	birthCountry not in (select country from countries)
    group by birthCountry;

 * mysql+pymysql://dbuser:***@localhost
10 rows affected.

[('USA', 17254),
 ('D.R.', 761),
 ('CAN', 255),
 ('P.R.', 268),
 ('Bahamas', 6),
 ('South Korea', 23),
 ('Czech Republic', 6),
 ('V.I.', 14),
 ('Viet Nam', 1),
 ('At Sea', 1)]

- My proposed corrections for ```birthCountry``` are:

| birthCountry   | ISO3 | ISO2 | Correct Country Name |
|----------------|------|------|----------------------|
| Bahamas        | BHS  | BS   | Bahamas, The         |
| CAN            | CAN  | CA   | Canada               |
| Czech Republic | CZE  | CZ   | Czechia              |
| South Korea    | KOR  | KR   | Korea, South         |
| USA            | USA  | US   | United States        |
| Viet Nam       | VNM  | VN   | Vietnam              |
| D.R.           | DOM  | DO   | Dominican Republic   |
| P.R.           | PRI  | PR   | Puerto Rico          |
| V.I.           | USA  | US   | United States        |
| At Sea         | NULL | NULL | NULL                 |


- Correct ```people_modified```, making the following changes:
    1. Add a column ```birthCountryISO3```
    2. Correct the entries for ```birthCountry.```
    3. Populate the values for ```birthCountryISO3```
    4. Set up a foreign key relationship from ```people_modified``` to ```countries.```
    5. Drop the column ```birthCountry.```

<u>Answer</u>

- Show your SQL statements for altering the table below.

- Run a couple of queries to show correctly modified table.

~~~~sql
CREATE TABLE IF NOT EXISTS f21midterm.people_modified LIKE lahmansbaseballdb.people;
INSERT f21midterm.people_modified SELECT * FROM lahmansbaseballdb.people;

ALTER TABLE f21midterm.people_modified
ADD COLUMN birthCountryISO3 varchar(300);

UPDATE f21midterm.people_modified SET birthCountry='Bahamas, The' WHERE birthCountry='Bahamas';
UPDATE f21midterm.people_modified SET birthCountry='Canada' WHERE birthCountry='CAN';
UPDATE f21midterm.people_modified SET birthCountry='Czechia' WHERE birthCountry='Czech Republic';
UPDATE f21midterm.people_modified SET birthCountry='Korea, South' WHERE birthCountry='South Korea';
UPDATE f21midterm.people_modified SET birthCountry='United States' WHERE birthCountry='USA';
UPDATE f21midterm.people_modified SET birthCountry='Vietnam' WHERE birthCountry='Viet Nam';
UPDATE f21midterm.people_modified SET birthCountry='Dominican Republic' WHERE birthCountry='D.R.';
UPDATE f21midterm.people_modified SET birthCountry='Puerto Rico' WHERE birthCountry='P.R.';
UPDATE f21midterm.people_modified SET birthCountry='United States' WHERE birthCountry='V.I.';
UPDATE f21midterm.people_modified SET birthCountry='NULL' WHERE birthCountry='At Sea';

Update
  f21midterm.people_modified as P
  inner join f21midterm.countries as C
on P.birthCountry = C.country
set P.birthCountryISO3 = CONCAT(P.birthCountry, ' : ', C.iso3)
~~~~